Revit 2026 API

# TransformScaleBasisAndOrigin Method

---

Scales the basis vectors and the origin of this transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform ScaleBasisAndOrigin(
	double scale
)
```
```vb
Public Function ScaleBasisAndOrigin (
	scale As Double
) As Transform
```
```cpp
public:
Transform^ ScaleBasisAndOrigin(
	double scale
)
```
```fsharp
member ScaleBasisAndOrigin :
        scale : float -> Transform
```

#### Parameters

scale Double
    The scale value.

#### Return Value

TransformThe transformation equal to the composition of the two transformations.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |

The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace